lib/XMLtemplates/024-01_1G_AirLowFareSearch-Sync_Rq.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Release 33-->
<!--Version Dated as of 14/Aug/2015 18:47:44-->
<!--Air Low Fare Search For Galileo(1G) Request-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <air:LowFareSearchReq AuthorizedBy="user" TraceId="{{requestId}}" TargetBranch="{{TargetBranch}}" ReturnUpsellFare="true" xmlns:air="http://www.travelport.com/schema/air_v33_0">
            <com:BillingPointOfSaleInfo OriginApplication="uAPI" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
            {{#legs}}
            <air:SearchAirLeg>
                <air:SearchOrigin>
                    <com:CityOrAirport Code="{{from}}" PreferCity="true" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
                </air:SearchOrigin>
                <air:SearchDestination>
                    <com:CityOrAirport Code="{{to}}" PreferCity="true" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
                </air:SearchDestination>
                <air:SearchDepTime PreferredTime="{{departureDate}}"/>
            </air:SearchAirLeg>
            {{/legs}}
            <air:AirSearchModifiers>
                <air:PreferredProviders>
                    <com:Provider Code="1G" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
                </air:PreferredProviders>
            </air:AirSearchModifiers>
            {{#passengers}}
            <com:SearchPassenger Code="{{ageCategory}}" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
            {{/passengers}}
        </air:LowFareSearchReq>
    </soap:Body>
</soap:Envelope>